app/controllers/tabel5s_controller.rb

SELECT "tabel5s".* FROM "tabel5s"
---
  def index
    @tabel5s = Tabel5.all