app/controllers/tests_controller.rb

SELECT "tests".* FROM "tests"
---
  def index
    @tests = Test.all

INSERT INTO "tests" ("name", "altceva", "alo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "gavu"], ["altceva", "lolo"], ["alo", "alo?"], ["created_at", "2019-11-04 17:22:11.739733"], ["updated_at", "2019-11-04 17:22:11.739733"]]
---
  def create
    @test = Test.new(test_params)

    respond_to do |format|
      if @test.save

SELECT  "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_test
      @test = Test.find(params[:id])